In [16]:
# Construct a DataFrame in Pandas using string data

In [17]:
#Solution #1: One way to achieve this is by using the StringIO() function.
#It will act as a wrapper and it will help use read the data using the pd.read_csv() function.

In [19]:
import pandas as pd
from io import StringIO

In [44]:
# wrap the string data in StringIO function
StringData = StringIO("""Date;Event;Cost
    10/2/2011;Music;10000
    11/2/2011;Poetry;12000
    12/2/2011;Theatre;5000
    13/2/2011;Comedy;8000
    """)

In [45]:
df = pd.read_csv(StringData, sep =";")

In [46]:
df

            Date    Event   Cost
0      10/2/2011    Music  10000
1      11/2/2011   Poetry  12000
2      12/2/2011  Theatre   5000
3      13/2/2011   Comedy   8000

In [47]:
import pandas as pd

In [53]:
StringData ="""Date;Event;Cost
    10/2/2011;Music;10000
    11/2/2011;Poetry;12000
    12/2/2011;Theatre;5000
    13/2/2011;Comedy;8000
    """

In [54]:
print(StringData)

Date;Event;Cost
    10/2/2011;Music;10000
    11/2/2011;Poetry;12000
    12/2/2011;Theatre;5000
    13/2/2011;Comedy;8000

In [55]:
df = pd.read_clipboard(StringData)

In [56]:
df

  StringData ="""Date;Event;Cost
0          10/2/2011;Music;10000
1         11/2/2011;Poetry;12000
2         12/2/2011;Theatre;5000
3          13/2/2011;Comedy;8000
4                            """

In [58]:
df = pd.read_clipboard(sep=';')

In [59]:
df

  StringData ="""Date    Event     Cost
0           10/2/2011    Music  10000.0
1           11/2/2011   Poetry  12000.0
2           12/2/2011  Theatre   5000.0
3           13/2/2011   Comedy   8000.0
4                 """      NaN      NaN

In [60]:
StringData ="""Date;Event;Cost
    10/2/2011;Music;10000
    11/2/2011;Poetry;12000
    12/2/2011;Theatre;5000
    13/2/2011;Comedy;8000
    """

df = pd.read_clipboard(sep=';')# clipboard usefull for reading a string formated data
df

  StringData ="""Date    Event     Cost
0           10/2/2011    Music  10000.0
1           11/2/2011   Poetry  12000.0
2           12/2/2011  Theatre   5000.0
3           13/2/2011   Comedy   8000.0
4                 """      NaN      NaN